//надо считать из файла первуюстроку которую записать в отдельный массив1
//остальные строки это двумерный массив arr - карта
//аргументы массива1 это 
//mass[0] = x - number of strings
//mass[1] - char symbol of empty space
//mass[2] - char symbol of obstacles
//mass[3] - char symbol of full space
//в функции arr_to_matrix char *emp - это mass[1]
/* план: разобраться как заполнить *mass and **arr из файла
цикл чтобы считывать много карт
проверить работают ли мои функции
поиск x and y в отдельны функуиях
изменить или соза=дать новый **arr2 с заполненной площадью
// вывести новый **arr2 */